let a= 1,b=2,c=3;

// 基本原理：与(&&)有0则停，或(||)有1则停

/**
 * 与在前，或在后
 * 整与为1，或不执行，赋值为与后
 * 整与为0，或执行，赋值为或后
 * 与前为0，与后不执行，或后执行，赋值为或后
 * 与前为1，与后执行，循环1，2
*/
// let d = a-- && b-- || c++
//a=0 b=1 c=3 d=2

/**
 * 或在前，与在后
 * 或前为1，后不执行，赋值为前
 * 或前为0，后执行,
 * 与前为0，后不执行，赋值为0
 * 与前为1，后执行，赋值为后
*/
let e = --a || b++ && c++
//a=0 b=3 c=4 e=3

console.log('a=',a);
console.log('b=',b);
console.log('c=',c);
// console.log('d=',d);
console.log('e=',e);



// let i=1 , j = 0, k = 0, z;
// z = i++ || j++ && k++;

// console.log('\ni=',i);//2
// console.log('j=',j);//0
// console.log('k=',k);//0
// console.log('z=',z);//1



